tap "ddev/ddev"
tap "golangci/tap"
tap "harelba/q"
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# All in one for **env
brew "anyenv"
# Library for manipulating PNG images
brew "libpng"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Graphics library to dynamically manipulate images
brew "gd"
# Network authentication protocol
brew "krb5"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Reimplementation of ctags(1)
brew "ctags"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Text processing system for reStructuredText
brew "docutils"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Add GitHub support to git on the command-line
brew "hub"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Image manipulation library
brew "jpeg"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# GNOME XML library
brew "libxml2"
# Powerful, lightweight programming language
brew "lua"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# PNG image optimizing utility
brew "pngquant"
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# NetBSD's FTP client
brew "tnftp"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# DDEV
brew "ddev/ddev/ddev"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Run SQL directly on CSV or TSV files, and on multiple sqlite databases
brew "harelba/q/q"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# E-book reader
cask "adobe-digital-editions"
# Application launcher and productivity software
cask "alfred"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Application uninstaller
cask "appcleaner"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Clipboard extension app
cask "clipy"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# Application window manager focusing on simplicity
cask "divvy"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# GitHub notifications on your menu bar
cask "gitify"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Screenshot and screen recording tool
cask "gyazo"
# Open-source video transcoder
cask "handbrake"
# Allows keymap customization on HHKB HYBRID Type-S and HYBRID models
cask "hhkb"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Shows current IP address in menu bar
cask "ip-in-menu-bar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Animated screen capture application
cask "licecap"
# WordPress local development tool by Flywheel
cask "local"
# Video format converter (transcoder)
cask "makemkv"
# Web development solution with Apache, Nginx, PHP & MySQL
cask "mamp"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Sandbox construction video game
cask "minecraft"
# Minecraft launcher
cask "multimc"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# PHP IDE by JetBrains
cask "phpstorm"
# Translation editor
cask "poedit"
# Stops you from accidentally quitting an app
cask "qblocker"
# Collect, organise & share colours
cask "sip"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# App to switch hosts
cask "switchhosts"
# Native GUI tool for relational databases
cask "tableplus"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Lossless audio decoder
cask "xld"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "avneeshagarwal.react-nextjs-snippets"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "chunsen.bracket-select"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "killalau.vscode-liquid-snippets"
vscode "mechatroner.rainbow-csv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "p26frqxxfmwrzekd6c6fcty5kipjkr3gaeejzpkyy42p5udjkjyq.darkplus-php-plum-tags"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "pucelle.vscode-css-navigation"
vscode "pulkitgangwar.nextjs-snippets"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "seatonjiang.gitmoji-vscode"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sissel.shopify-liquid"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "teabyii.ayu"
vscode "tomoki1207.vscode-input-sequence"
vscode "valeryanm.vscode-phpsab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vunguyentuan.vscode-postcss"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "youssef.viow"
vscode "yzhang.markdown-all-in-one"
vscode "zhangciwu.swig-tpl"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"

# AppStore
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Things", id: 904280696
mas "CLCL Lite", id: 495511246
mas "DemoPro", id: 1384206666
mas "Be Focused Pro", id: 961632517
mas "PopClip", id: 445189367
