# Premise
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "stripe/stripe-cli"

# CLI
brew "ack"
brew "amazon-ecs-cli"
brew "anyenv"
brew "apr-util"
brew "coreutils"
brew "asdf"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "bazelisk"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "bundletool"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "ctags"
brew "curl"
brew "lame"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "libidn"
brew "ghq"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "ios-deploy"
brew "iproute2mac"
brew "jpeg"
brew "jq"
brew "libpq"
brew "libuv"
brew "libxml2"
brew "lua"
brew "lv"
brew "mas"
brew "mcrypt"
brew "mercurial"
brew "mingw-w64"
brew "multitail"
brew "neovim"
brew "nkf"
brew "node"
brew "openapi-generator"
brew "peco"
brew "perl"
brew "php"
brew "plantuml"
brew "pngquant"
brew "pstree"
brew "pwgen"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "stern"
brew "tig"
brew "tmux"
brew "tnftp"
brew "tree"
brew "watch"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "golangci/tap/golangci-lint"
brew "stripe/stripe-cli/stripe"

# GUI
cask "adobe-creative-cloud"
cask "alfred"
cask "android-platform-tools"
cask "appcleaner"
cask "bartender"
cask "bettertouchtool"
cask "blisk"
cask "brave-browser"
cask "chromium"
cask "clipy"
cask "dash"
cask "deepl"
cask "discord"
cask "divvy"
cask "dropbox"
cask "firefox"
cask "gitify"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "handbrake"
cask "imageoptim"
cask "ip-in-menu-bar"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keyboard-cleaner"
cask "licecap"
cask "makemkv"
cask "mamp"
cask "microsoft-remote-desktop"
cask "multimc"
cask "notion"
cask "poedit"
cask "qblocker"
cask "sip"
cask "skitch"
cask "skype"
cask "slack"
cask "soundflower"
cask "steam"
cask "tableplus"
cask "telegram"
cask "tradingview"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "xld"
cask "zoom"

# VSCODE
vscode "bmewburn.vscode-intelephense-client"
vscode "devsense.profiler-php-vscode"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "github.github-vscode-theme"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "killalau.vscode-liquid-snippets"
vscode "mosapride.zenkaku"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "p26frqxxfmwrzekd6c6fcty5kipjkr3gaeejzpkyy42p5udjkjyq.darkplus-php-plum-tags"
vscode "pkief.material-icon-theme"
vscode "sissel.shopify-liquid"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tomoki1207.vscode-input-sequence"
vscode "vscode-icons-team.vscode-icons"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "youssef.viow"
vscode "yzhang.markdown-all-in-one"
vscode "zhangciwu.swig-tpl"
vscode "zobo.php-intellisense"

# AppStore
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Things", id: 904280696
mas "CLCL Lite", id: 495511246
mas "DemoPro", id: 1384206666
mas "Be Focused Pro", id: 961632517
mas "PopClip", id: 445189367
