tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "zsh"
brew 'zsh-completions'
brew "git"
brew "reattach-to-user-namespace"
brew "neovim"
brew "tmux"
brew 'node'
brew "anyenv"
brew "bundletool"
brew "cmake"
brew 'ctags'
brew "curl"
brew 'lua'
brew 'hub'
brew "lame"
brew "ffmpeg"
brew "imagemagick"
brew "jq"
brew "libuv"
brew 'java'
brew 'mas'
brew "openjdk"
brew "peco"
brew "perl"
brew "pngquant"
brew "pwgen"
brew "tig"

brew "tnftp"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "zlib"

# Cask's Dev

cask "iterm2"
cask "alfred"
cask "android-sdk"
cask "visual-studio-code"
cask 'android-platform-tools'
cask 'google-cloud-sdk'

# Cask's UI

cask 'karabiner-elements'
cask "bartender"
cask "bettertouchtool"
cask "dash"
cask "divvy"
cask "clipy"
cask "keepingyouawake"
cask "keyboard-cleaner"
cask "appcleaner"
cask "qblocker"

# Browser

cask "google-chrome"
cask "chromium"
cask "brave-browser"
cask "waterfox"

# Design

cask "adobe-creative-cloud"

# Chat

cask "discord"
cask "slack"
cask "skype"
cask "telegram"

# Media

cask "google-japanese-ime"
cask "gyazo"
cask "handbrake"
cask "cooviewer"
cask "ip-in-menu-bar"
cask "kindle"
cask "makemkv"
cask "skitch"
cask "vlc"
cask "imageoptim"
cask "dropbox"

# Other

cask 'steam'
cask "licecap"
cask "microsoft-remote-desktop"
cask "tableplus"
cask "xld"
cask 'deepl'
cask 'gitify'

# AppStore

mas 'The Unarchiver', id: 425_424_353
mas 'LINE', id: 539_883_307
